NicoHood/HID/avr/boards.txt
#HID Project board definition file

menu.usbcore=USB Core
menu.keys=Keyboard Layout


##############################################################

leonardoExtended.name=Arduino Leonardo HID-Project
leonardoExtended.upload.tool=arduino:avrdude
leonardoExtended.upload.protocol=avr109
leonardoExtended.upload.maximum_size=28672
leonardoExtended.upload.maximum_data_size=2560
leonardoExtended.upload.speed=57600
leonardoExtended.upload.disable_flushing=true
leonardoExtended.upload.use_1200bps_touch=true
leonardoExtended.upload.wait_for_upload_port=true

leonardoExtended.bootloader.tool=arduino:avrdude
leonardoExtended.bootloader.low_fuses=0xff
leonardoExtended.bootloader.high_fuses=0xd8
leonardoExtended.bootloader.extended_fuses=0xcb
leonardoExtended.bootloader.file=arduino:caterina/Caterina-leonardo.hex
leonardoExtended.bootloader.unlock_bits=0x3F
leonardoExtended.bootloader.lock_bits=0x2F

leonardoExtended.build.mcu=atmega32u4
leonardoExtended.build.f_cpu=16000000L
leonardoExtended.build.core=HID:hid
leonardoExtended.build.vid=0x2341
#leonardoExtended.build.pid=0x8036
leonardoExtended.build.usb_product="Arduino Leonardo"
leonardoExtended.build.board=AVR_LEONARDO
leonardoExtended.build.extra_flags={build.usb_flags}

#USB core selection
#HID Project needs to be installed https://github.com/NicoHood/HID
leonardoExtended.menu.usbcore.hid=Serial + Extended HID
leonardoExtended.menu.usbcore.hid.build.variant=leonardo_hid
leonardoExtended.menu.usbcore.hid.build.pid=0x8036
leonardoExtended.menu.usbcore.gamepad=Serial + Gamepad HID
leonardoExtended.menu.usbcore.gamepad.build.variant=leonardo_gamepad
leonardoExtended.menu.usbcore.gamepad.build.pid=0x8036
leonardoExtended.menu.usbcore.custom=Serial + Custom HID
leonardoExtended.menu.usbcore.custom.build.variant=leonardo_custom
leonardoExtended.menu.usbcore.custom.build.pid=0x8036
leonardoExtended.menu.usbcore.USB_CORE=Default Core
leonardoExtended.menu.usbcore.USB_CORE.build.variant=leonardo
leonardoExtended.menu.usbcore.USB_CORE.build.pid=0x8036
leonardoExtended.menu.usbcore.NO_USB=No USB functions
leonardoExtended.menu.usbcore.NO_USB.build.variant=leonardo_no_usb
leonardoExtended.menu.usbcore.NO_USB.build.pid=0x8036

#Layout selection
#Copied from Teensyduino
leonardoExtended.menu.keys.en-us=US English
leonardoExtended.menu.keys.en-us.build.keylayout=US_ENGLISH
leonardoExtended.menu.keys.fr-ca=Canadian French
leonardoExtended.menu.keys.fr-ca.build.keylayout=CANADIAN_FRENCH
leonardoExtended.menu.keys.xx-ca=Canadian Multilingual
leonardoExtended.menu.keys.xx-ca.build.keylayout=CANADIAN_MULTILINGUAL
leonardoExtended.menu.keys.cz-cz=Czech
leonardoExtended.menu.keys.cz-cz.build.keylayout=CZECH
leonardoExtended.menu.keys.da-da=Danish
leonardoExtended.menu.keys.da-da.build.keylayout=DANISH
leonardoExtended.menu.keys.fi-fi=Finnish
leonardoExtended.menu.keys.fi-fi.build.keylayout=FINNISH
leonardoExtended.menu.keys.fr-fr=French
leonardoExtended.menu.keys.fr-fr.build.keylayout=FRENCH
leonardoExtended.menu.keys.fr-be=French Belgian
leonardoExtended.menu.keys.fr-be.build.keylayout=FRENCH_BELGIAN
leonardoExtended.menu.keys.fr-ch=French Swiss
leonardoExtended.menu.keys.fr-ch.build.keylayout=FRENCH_SWISS
leonardoExtended.menu.keys.de-de=German
leonardoExtended.menu.keys.de-de.build.keylayout=GERMAN
leonardoExtended.menu.keys.de-dm=German (Mac)
leonardoExtended.menu.keys.de-dm.build.keylayout=GERMAN_MAC
leonardoExtended.menu.keys.de-ch=German Swiss
leonardoExtended.menu.keys.de-ch.build.keylayout=GERMAN_SWISS
leonardoExtended.menu.keys.is-is=Icelandic
leonardoExtended.menu.keys.is-is.build.keylayout=ICELANDIC
leonardoExtended.menu.keys.en-ie=Irish
leonardoExtended.menu.keys.en-ie.build.keylayout=IRISH
leonardoExtended.menu.keys.it-it=Italian
leonardoExtended.menu.keys.it-it.build.keylayout=ITALIAN
leonardoExtended.menu.keys.no-no=Norwegian
leonardoExtended.menu.keys.no-no.build.keylayout=NORWEGIAN
leonardoExtended.menu.keys.pt-pt=Portuguese
leonardoExtended.menu.keys.pt-pt.build.keylayout=PORTUGUESE
leonardoExtended.menu.keys.pt-br=Portuguese Brazilian
leonardoExtended.menu.keys.pt-br.build.keylayout=PORTUGUESE_BRAZILIAN
leonardoExtended.menu.keys.rs-rs=Serbian (Latin Only)
leonardoExtended.menu.keys.rs-rs.build.keylayout=SERBIAN_LATIN_ONLY
leonardoExtended.menu.keys.es-es=Spanish
leonardoExtended.menu.keys.es-es.build.keylayout=SPANISH
leonardoExtended.menu.keys.es-mx=Spanish Latin America
leonardoExtended.menu.keys.es-mx.build.keylayout=SPANISH_LATIN_AMERICA
leonardoExtended.menu.keys.sv-se=Swedish
leonardoExtended.menu.keys.sv-se.build.keylayout=SWEDISH
leonardoExtended.menu.keys.tr-tr=Turkish (partial)
leonardoExtended.menu.keys.tr-tr.build.keylayout=TURKISH
leonardoExtended.menu.keys.en-gb=United Kingdom
leonardoExtended.menu.keys.en-gb.build.keylayout=UNITED_KINGDOM
leonardoExtended.menu.keys.usint=US International
leonardoExtended.menu.keys.usint.build.keylayout=US_INTERNATIONAL

##############################################################

microExtended.name=Arduino Micro HID-Project
microExtended.upload.tool=arduino:avrdude
microExtended.upload.protocol=avr109
microExtended.upload.maximum_size=28672
microExtended.upload.maximum_data_size=2560
microExtended.upload.speed=57600
microExtended.upload.disable_flushing=true
microExtended.upload.use_1200bps_touch=true
microExtended.upload.wait_for_upload_port=true

microExtended.bootloader.tool=arduino:avrdude
microExtended.bootloader.low_fuses=0xff
microExtended.bootloader.high_fuses=0xd8
microExtended.bootloader.extended_fuses=0xcb
microExtended.bootloader.file=arduino:caterina/Caterina-Micro.hex
microExtended.bootloader.unlock_bits=0x3F
microExtended.bootloader.lock_bits=0x2F

microExtended.build.mcu=atmega32u4
microExtended.build.f_cpu=16000000L
microExtended.build.core=HID:hid
microExtended.build.vid=0x2341
#microExtended.build.pid=0x8037
microExtended.build.usb_product="Arduino Micro"
microExtended.build.board=AVR_MICRO
microExtended.build.extra_flags={build.usb_flags}

#USB core selection
#HID Project needs to be installed https://github.com/NicoHood/HID
microExtended.menu.usbcore.hid=Serial + Extended HID
microExtended.menu.usbcore.hid.build.variant=micro_hid
microExtended.menu.usbcore.hid.build.pid=0x8037
microExtended.menu.usbcore.gamepad=Serial + Gamepad HID
microExtended.menu.usbcore.gamepad.build.variant=micro_gamepad
microExtended.menu.usbcore.gamepad.build.pid=0x8037
microExtended.menu.usbcore.custom=Serial + Custom HID
microExtended.menu.usbcore.custom.build.variant=micro_custom
microExtended.menu.usbcore.custom.build.pid=0x8037
microExtended.menu.usbcore.USB_CORE=Default Core
microExtended.menu.usbcore.USB_CORE.build.variant=micro
microExtended.menu.usbcore.USB_CORE.build.pid=0x8037
microExtended.menu.usbcore.NO_USB=No USB functions
microExtended.menu.usbcore.NO_USB.build.variant=micro_no_usb
microExtended.menu.usbcore.NO_USB.build.pid=0x8037

